
const init = (QQSG)=>{
    if(!QQSG){ return {} }
    //基础数据
    this.QQSG = QQSG || {};
    this.QQSG.d2b = this.QQSG.SGB/this.QQSG.SGD;
    this.QQSG.b2d = this.QQSG.SGD/this.QQSG.SGB;
    this.QQSG.bsg = {
        '点换币/1': { price:this.QQSG.d2b },
        '币换点/百万': { price:this.QQSG.b2d*1000000 },
        '小铁椎': { price:500 },
        '精铁椎': { price:1000 },
        '精致凿': { price:460 },
        '小凿子': { price:230 },
        // '小铁椎': { price:475 },
        // '精铁椎': { price:950 },
        // '小凿子': { price:219 },
        // '精致凿': { price:437 },

        '金之微尘':{ '精致凿': 4 },
        '银之微尘':{ '小凿子': 8 },
        '铜之微尘':{ '小铁椎': 4 },

        '金之精粹':{ '金之微尘': 10 },
        '银之精粹':{ '银之微尘': 10 },
        '铜之精粹':{ '铜之微尘': 10 },
        
        '财富之源':{ '金之精粹': 1, '银之精粹': 1, '铜之精粹': 1 },
        '能量之源':{ price: 270000 },
        

        '低级装备模':{ price:30000 },//10,20
        '中级装备模':{ price:200000 },//30,40
        '高级装备模':{ price:400000 },//50,60
        '极品装备模':{ price:800000 },//70,80
        '帝品装备模':{ price:800000 },//90,100
        '绝品装备模':{ price:2000000 },//110,120
        '尊品装备模':{ price:2000000 },//130
        '三级琢孔玉':{ price:10000 },
        '调合剂':{ price:10*this.QQSG.d2b,  },
        '一级黄色晶玉':{ price:4000 },
        '一级橙色晶玉':{ '一级黄色晶玉':10, '调合剂':1 },
        '一级红色晶玉':{ '一级橙色晶玉':10, '调合剂':5 },
        '二级黄色晶玉':{ '一级黄色晶玉':2 },
        '二级橙色晶玉':{ '二级黄色晶玉':10, '调合剂':1 },
        '二级红色晶玉':{ '二级橙色晶玉':10, '调合剂':5 },
        '三级黄色晶玉':{ '二级黄色晶玉':2 },
        '三级橙色晶玉':{ '三级黄色晶玉':10, '调合剂':1 },
        '三级红色晶玉':{ '三级橙色晶玉':10, '调合剂':5 },

        '四级黄色晶玉':{ '三级黄色晶玉':2, price:.88*this.QQSG.d2b },
        '四级橙色晶玉':{ '四级黄色晶玉':10, '调合剂':1 },
        '四级红色晶玉':{ '四级橙色晶玉':10, '调合剂':5 },
        '五级黄色晶玉':{ '四级黄色晶玉':2 },
        '五级橙色晶玉':{ '五级黄色晶玉':10, '调合剂':1 },
        '五级红色晶玉':{ '五级橙色晶玉':10, '调合剂':5 },
        '六级黄色晶玉':{ '五级黄色晶玉':3 },
        '六级橙色晶玉':{ '六级黄色晶玉':10, '调合剂':1 },
        '六级红色晶玉':{ '六级橙色晶玉':10, '调合剂':5 },
        '七级黄色晶玉':{ '六级黄色晶玉':3 },
        '七级橙色晶玉':{ '七级黄色晶玉':10, '调合剂':1 },
        '七级红色晶玉':{ '七级橙色晶玉':10, '调合剂':5 },
        '八级黄色晶玉':{ '七级黄色晶玉':4 },
        '八级橙色晶玉':{ '八级黄色晶玉':10, '调合剂':1 },
        '八级红色晶玉':{ '八级橙色晶玉':10, '调合剂':5 },

        '九级黄色晶玉':{ '八级黄色晶玉':1, '调合剂':5 },
        '九级橙色晶玉':{ '九级黄色晶玉':10, '调合剂':1 },
        '九级红色晶玉':{ '九级橙色晶玉':10, '调合剂':5 },
        '十级黄色晶玉':{ '九级黄色晶玉':1, '调合剂':5 },
        '十级橙色晶玉':{ '十级黄色晶玉':10, '调合剂':1 },
        '十级红色晶玉':{ '十级橙色晶玉':10, '调合剂':5 },

        '天星石':{ '能量之源':1, '霜晶石':1, '金粉':1 },
        '霜晶石':{ price:35000 },
        '金粉':{ price:30000 },
        '碎玉':{ price:500/300*this.QQSG.d2b },
        '天星珏':{ '天星石':1, '碎玉':2 },

        '十一级黄色晶玉':{ '十级黄色晶玉':1, '调合剂':1, '天星石':5 },
        '十一级橙色晶玉':{ '十一级黄色晶玉':10, '调合剂':5 },
        '十一级红色晶玉':{ '十一级橙色晶玉':9, '调合剂':5 },
        '十二级黄色晶玉':{ '十一级黄色晶玉':1, '调合剂':5, '天星石':1 },
        '十二级橙色晶玉':{ '十二级黄色晶玉':10, '调合剂':5 },
        '十二级红色晶玉':{ '十二级橙色晶玉':9, '调合剂':5 },
        '十三级黄色晶玉':{ '十二级黄色晶玉':1, '调合剂':8 },
        '十三级橙色晶玉':{ '十三级黄色晶玉':10, '调合剂':8 },
        '十三级红色晶玉':{ '十三级橙色晶玉':9, '调合剂':8 },
        '十四级黄色晶玉':{ '十三级黄色晶玉':1, '调合剂':9, '天星珏':3 },
        '十四级橙色晶玉':{ '十四级黄色晶玉':10, '调合剂':9 },
        '十四级红色晶玉':{ '十四级橙色晶玉':9, '调合剂':9 },
    };
    return this.QQSG.bsg;
};

const baseGoods = {
    init: init
};
export default baseGoods